In [1]:
import numpy as np
import pandas as pd

In [10]:
dict={'A':[1,3,6],'B':[4,np.nan,np.nan],'C':[6,8,np.nan]}

In [11]:
df=pd.DataFrame(dict)

In [12]:
df

   A    B    C
0  1  4.0  6.0
1  3  NaN  8.0
2  6  NaN  NaN

In [13]:
df.dropna()

   A    B    C
0  1  4.0  6.0

In [14]:
df.dropna(axis=1)

   A
0  1
1  3
2  6

In [16]:
df.dropna(thresh=2)
# it will print rows that have atleast 2 non na values

   A    B    C
0  1  4.0  6.0
1  3  NaN  8.0

In [18]:
df

   A    B    C
0  1  4.0  6.0
1  3  NaN  8.0
2  6  NaN  NaN

In [17]:
df.fillna(value="yes")

   A    B    C
0  1    4    6
1  3  yes    8
2  6  yes  yes

In [19]:
df['A'].fillna(value=df['A'].mean())

0    1
1    3
2    6
Name: A, dtype: int64